import 'package:flutter/material.dart';
import 'package:samayalkurippu/model/categories.dart';
import 'dart:math' as math;

import 'package:samayalkurippu/model/dishes.dart';

double headingfont = 25;
Color appmainthemecolor = Colors.deepPurple;
bool favroitColorstate = false;
Color favroitColor = Colors.white;
IconData favroticon = Icons.favorite_border_outlined;
final rnd = math.Random();
List<Categories> foodCategory = [
  Categories(
      id: "1",
      name: "Vegetarian Recipes",
      desc: "vegetarian Recipes",
      image: "veg",
      shortName: "veg"),
  Categories(
      id: "2",
      name: "Kuzhambu Recipes",
      desc: "Kuzhambu Recipes",
      image: "kuzhambu",
      shortName: "kuzhambu"),
  Categories(
      id: "3",
      name: "Poriyal Recipes",
      desc: "Poriyal Recipes",
      image: "poriyal",
      shortName: "poriyal"),
  Categories(
      id: "4",
      name: "Variety Rice",
      desc: "Variety Rice",
      image: "varietyrice",
      shortName: "variety_rice"),
  Categories(
      id: "5",
      name: "Rasam",
      desc: "Rasam Recipes",
      image: "rasam",
      shortName: "rasam"),
  Categories(
      id: "6",
      name: "Thokku",
      desc: "Thokku Recipes",
      image: "thokku",
      shortName: "thokku"),
  Categories(
      id: "7",
      name: "Pickle Recipes",
      desc: "Pickle Recipes",
      image: "pickle",
      shortName: "pickle"),
  Categories(
      id: "8",
      name: "Non-Vegetarian",
      desc: "Non-Vegetarian",
      image: "nonveg",
      shortName: "nonveg"),
  Categories(
      id: "9",
      name: "Chicken Recipes",
      desc: "Chicken Recipes",
      image: "chicken",
      shortName: "chicken"),
  Categories(
      id: "10",
      name: "Mutton Recipes",
      desc: "Mutton Recipes",
      image: "mutton",
      shortName: "mutton"),
  Categories(
      id: "11",
      name: "Fish Recipes",
      desc: "Fish Recipes",
      image: "fish",
      shortName: "fish"),
  Categories(
      id: "12",
      name: "Egg Recipes",
      desc: "Egg Recipes",
      image: "egg",
      shortName: "egg"),
  Categories(
      id: "13",
      name: "Tiffen Recipes",
      desc: "Tiffen Recipes",
      image: "tiffen",
      shortName: "tiffen"),
  Categories(
      id: "14",
      name: "Snacks",
      desc: "Snacks",
      image: "snacks",
      shortName: "snacks"),
  Categories(
      id: "15",
      name: "Sweet",
      desc: "Sweet",
      image: "sweet",
      shortName: "sweet"),
  Categories(
      id: "16", name: "Soup", desc: "Soup", image: "soup", shortName: "soup"),
  Categories(
      id: "17",
      name: "Juice",
      desc: "Juice",
      image: "juice",
      shortName: "juice"),
  Categories(
      id: "about",
      name: "About",
      desc: "About SamayalKurippu Apps",
      image: "about",
      shortName: "about")
];

List<Dishes> dishList = [
  Dishes(
      id: "1",
      image: "",
      title: "கத்திரிக்காய் குழம்பு ",
      categoryId: 1,
      youtubeVideoId: "",
      message:
          "\r<br>\r<br><b>தேவையான பொருள்கள்:</b>\r<br>\r<br>சிறிய பிஞ்சு கத்திரிக்காய் 10\r<br>சின்ன வெங்காயம் 10\r<br>பூண்டு 10 பல்\r<br>தக்காளி 2\r<br>புளி ஒரு எலுமிச்சை அளவு\r<br>மஞ்சள்தூள் 1 டீஸ்பூன்\r<br>தனியாதூள் 1 டீஸ்பூன்\r<br>மிளகாய்தூள் 2 டீஸ்பூன்\r<br>நல்லெண்ணைய் கால் கப்\r<br>\r<br>தாளிக்க:\r<br>\r<br>கடுகு 1/2 டீஸ்பூன்\r<br>உளுத்தம்பருப்பு 1 டீஸ்பூன்\r<br>சோம்பு 1 டீஸ்பூன்\r<br>சீரகம் 1 டீஸ்பூன்\r<br>மிளகாய் வற்றல் 2\r<br>கறிவேப்பிலை ஒரு கொத்து\r<br>\r<br>அரைக்க:\r<br>\r<br>தேங்காய் துருவல் அரை கப்\r<br>முந்திரி 8\r<br>\r<br><b>செய்முறை:</b>\r<br>\r<br>சின்ன கத்திரிக்காயை குறுக்குவாட்டில்  நறுக்கிக்கொள்ளவும். சின்ன வெங்காயம்,பூண்டு இரண்டையும் உரித்துக்கொள்ளவும்.\r<br>தக்காளியை எண்ணைய் விட்டு நன்றாக வதக்கிக்கொள்ளவும்.புளியை இரண்டுகப் தண்ணீரில் கரைத்துக்கொள்ளவும். தேங்காய் துருவல்,முந்திரி இரண்டையும் நைசாக அரைத்துக்கொள்ளவும்.\r<br>\r<br>வாணலியில் நல்லெண்ணைய் விட்டு காய்ந்ததும் தாளிக்கவேண்டியவைகளை தாளிக்கவும்.\r<br>பின்னர் கத்திரிக்காய்,சின்ன வெங்காயம்,பூண்டு மூன்றையும் போட்டு நன்றாக வதக்கவும்.\r<br>செய்துவைத்த தக்காளி விழுதை போட்டு அதனுடன் ஒரு கப் தண்ணீர் ,உப்பு சேர்த்து நன்றாக கொதிக்கவைக்கவும்.\r<br>புளியை நன்றாக கரைத்து விடவும். பின்னர் மஞ்சள்தூள்,தனியா தூள்,மிளகாய் தூள் சேர்த்து கொதிக்கவிடவும்.\r<br>எண்ணைய் பிரிந்து வந்ததும் அரைத்த விழுதை சேர்த்து ஒரு கொதி வந்ததும் இறக்கவும்\r<br>"),
  Dishes(
      id: "2",
      image: "",
      title: "எலுமிச்சை குழம்பு ",
      categoryId: 1,
      youtubeVideoId: "",
      message:
          "\r<br>\r<br><b>தேவையான பொருள்கள்:</b>\r<br>\r<br>சிறிய பிஞ்சு கத்திரிக்காய் 10\r<br>சின்ன வெங்காயம் 10\r<br>பூண்டு 10 பல்\r<br>தக்காளி 2\r<br>புளி ஒரு எலுமிச்சை அளவு\r<br>மஞ்சள்தூள் 1 டீஸ்பூன்\r<br>தனியாதூள் 1 டீஸ்பூன்\r<br>மிளகாய்தூள் 2 டீஸ்பூன்\r<br>நல்லெண்ணைய் கால் கப்\r<br>\r<br>தாளிக்க:\r<br>\r<br>கடுகு 1/2 டீஸ்பூன்\r<br>உளுத்தம்பருப்பு 1 டீஸ்பூன்\r<br>சோம்பு 1 டீஸ்பூன்\r<br>சீரகம் 1 டீஸ்பூன்\r<br>மிளகாய் வற்றல் 2\r<br>கறிவேப்பிலை ஒரு கொத்து\r<br>\r<br>அரைக்க:\r<br>\r<br>தேங்காய் துருவல் அரை கப்\r<br>முந்திரி 8\r<br>\r<br><b>செய்முறை:</b>\r<br>\r<br>சின்ன கத்திரிக்காயை குறுக்குவாட்டில்  நறுக்கிக்கொள்ளவும். சின்ன வெங்காயம்,பூண்டு இரண்டையும் உரித்துக்கொள்ளவும்.\r<br>தக்காளியை எண்ணைய் விட்டு நன்றாக வதக்கிக்கொள்ளவும்.புளியை இரண்டுகப் தண்ணீரில் கரைத்துக்கொள்ளவும். தேங்காய் துருவல்,முந்திரி இரண்டையும் நைசாக அரைத்துக்கொள்ளவும்.\r<br>\r<br>வாணலியில் நல்லெண்ணைய் விட்டு காய்ந்ததும் தாளிக்கவேண்டியவைகளை தாளிக்கவும்.\r<br>பின்னர் கத்திரிக்காய்,சின்ன வெங்காயம்,பூண்டு மூன்றையும் போட்டு நன்றாக வதக்கவும்.\r<br>செய்துவைத்த தக்காளி விழுதை போட்டு அதனுடன் ஒரு கப் தண்ணீர் ,உப்பு சேர்த்து நன்றாக கொதிக்கவைக்கவும்.\r<br>புளியை நன்றாக கரைத்து விடவும். பின்னர் மஞ்சள்தூள்,தனியா தூள்,மிளகாய் தூள் சேர்த்து கொதிக்கவிடவும்.\r<br>எண்ணைய் பிரிந்து வந்ததும் அரைத்த விழுதை சேர்த்து ஒரு கொதி வந்ததும் இறக்கவும்\r<br>"),
  Dishes(
      id: "3",
      image: "",
      title: "முந்திரி குழம்பு ",
      categoryId: 1,
      youtubeVideoId: "",
      message:
          "\r<br>\r<br><b>தேவையான பொருள்கள்:</b>\r<br>\r<br>சிறிய பிஞ்சு கத்திரிக்காய் 10\r<br>சின்ன வெங்காயம் 10\r<br>பூண்டு 10 பல்\r<br>தக்காளி 2\r<br>புளி ஒரு எலுமிச்சை அளவு\r<br>மஞ்சள்தூள் 1 டீஸ்பூன்\r<br>தனியாதூள் 1 டீஸ்பூன்\r<br>மிளகாய்தூள் 2 டீஸ்பூன்\r<br>நல்லெண்ணைய் கால் கப்\r<br>\r<br>தாளிக்க:\r<br>\r<br>கடுகு 1/2 டீஸ்பூன்\r<br>உளுத்தம்பருப்பு 1 டீஸ்பூன்\r<br>சோம்பு 1 டீஸ்பூன்\r<br>சீரகம் 1 டீஸ்பூன்\r<br>மிளகாய் வற்றல் 2\r<br>கறிவேப்பிலை ஒரு கொத்து\r<br>\r<br>அரைக்க:\r<br>\r<br>தேங்காய் துருவல் அரை கப்\r<br>முந்திரி 8\r<br>\r<br><b>செய்முறை:</b>\r<br>\r<br>சின்ன கத்திரிக்காயை குறுக்குவாட்டில்  நறுக்கிக்கொள்ளவும். சின்ன வெங்காயம்,பூண்டு இரண்டையும் உரித்துக்கொள்ளவும்.\r<br>தக்காளியை எண்ணைய் விட்டு நன்றாக வதக்கிக்கொள்ளவும்.புளியை இரண்டுகப் தண்ணீரில் கரைத்துக்கொள்ளவும். தேங்காய் துருவல்,முந்திரி இரண்டையும் நைசாக அரைத்துக்கொள்ளவும்.\r<br>\r<br>வாணலியில் நல்லெண்ணைய் விட்டு காய்ந்ததும் தாளிக்கவேண்டியவைகளை தாளிக்கவும்.\r<br>பின்னர் கத்திரிக்காய்,சின்ன வெங்காயம்,பூண்டு மூன்றையும் போட்டு நன்றாக வதக்கவும்.\r<br>செய்துவைத்த தக்காளி விழுதை போட்டு அதனுடன் ஒரு கப் தண்ணீர் ,உப்பு சேர்த்து நன்றாக கொதிக்கவைக்கவும்.\r<br>புளியை நன்றாக கரைத்து விடவும். பின்னர் மஞ்சள்தூள்,தனியா தூள்,மிளகாய் தூள் சேர்த்து கொதிக்கவிடவும்.\r<br>எண்ணைய் பிரிந்து வந்ததும் அரைத்த விழுதை சேர்த்து ஒரு கொதி வந்ததும் இறக்கவும்\r<br>"),
  Dishes(
      id: "4",
      image: "",
      title: "பூண்டு குழம்பு ",
      categoryId: 2,
      youtubeVideoId: "",
      message:
          "\r<br>\r<br><b>தேவையான பொருள்கள்:</b>\r<br>\r<br>சிறிய பிஞ்சு கத்திரிக்காய் 10\r<br>சின்ன வெங்காயம் 10\r<br>பூண்டு 10 பல்\r<br>தக்காளி 2\r<br>புளி ஒரு எலுமிச்சை அளவு\r<br>மஞ்சள்தூள் 1 டீஸ்பூன்\r<br>தனியாதூள் 1 டீஸ்பூன்\r<br>மிளகாய்தூள் 2 டீஸ்பூன்\r<br>நல்லெண்ணைய் கால் கப்\r<br>\r<br>தாளிக்க:\r<br>\r<br>கடுகு 1/2 டீஸ்பூன்\r<br>உளுத்தம்பருப்பு 1 டீஸ்பூன்\r<br>சோம்பு 1 டீஸ்பூன்\r<br>சீரகம் 1 டீஸ்பூன்\r<br>மிளகாய் வற்றல் 2\r<br>கறிவேப்பிலை ஒரு கொத்து\r<br>\r<br>அரைக்க:\r<br>\r<br>தேங்காய் துருவல் அரை கப்\r<br>முந்திரி 8\r<br>\r<br><b>செய்முறை:</b>\r<br>\r<br>சின்ன கத்திரிக்காயை குறுக்குவாட்டில்  நறுக்கிக்கொள்ளவும். சின்ன வெங்காயம்,பூண்டு இரண்டையும் உரித்துக்கொள்ளவும்.\r<br>தக்காளியை எண்ணைய் விட்டு நன்றாக வதக்கிக்கொள்ளவும்.புளியை இரண்டுகப் தண்ணீரில் கரைத்துக்கொள்ளவும். தேங்காய் துருவல்,முந்திரி இரண்டையும் நைசாக அரைத்துக்கொள்ளவும்.\r<br>\r<br>வாணலியில் நல்லெண்ணைய் விட்டு காய்ந்ததும் தாளிக்கவேண்டியவைகளை தாளிக்கவும்.\r<br>பின்னர் கத்திரிக்காய்,சின்ன வெங்காயம்,பூண்டு மூன்றையும் போட்டு நன்றாக வதக்கவும்.\r<br>செய்துவைத்த தக்காளி விழுதை போட்டு அதனுடன் ஒரு கப் தண்ணீர் ,உப்பு சேர்த்து நன்றாக கொதிக்கவைக்கவும்.\r<br>புளியை நன்றாக கரைத்து விடவும். பின்னர் மஞ்சள்தூள்,தனியா தூள்,மிளகாய் தூள் சேர்த்து கொதிக்கவிடவும்.\r<br>எண்ணைய் பிரிந்து வந்ததும் அரைத்த விழுதை சேர்த்து ஒரு கொதி வந்ததும் இறக்கவும்\r<br>"),
  Dishes(
      id: "5",
      image: "",
      title: "வெங்காயம் குழம்பு ",
      categoryId: 2,
      youtubeVideoId: "",
      message:
          "\r<br>\r<br><b>தேவையான பொருள்கள்:</b>\r<br>\r<br>சிறிய பிஞ்சு கத்திரிக்காய் 10\r<br>சின்ன வெங்காயம் 10\r<br>பூண்டு 10 பல்\r<br>தக்காளி 2\r<br>புளி ஒரு எலுமிச்சை அளவு\r<br>மஞ்சள்தூள் 1 டீஸ்பூன்\r<br>தனியாதூள் 1 டீஸ்பூன்\r<br>மிளகாய்தூள் 2 டீஸ்பூன்\r<br>நல்லெண்ணைய் கால் கப்\r<br>\r<br>தாளிக்க:\r<br>\r<br>கடுகு 1/2 டீஸ்பூன்\r<br>உளுத்தம்பருப்பு 1 டீஸ்பூன்\r<br>சோம்பு 1 டீஸ்பூன்\r<br>சீரகம் 1 டீஸ்பூன்\r<br>மிளகாய் வற்றல் 2\r<br>கறிவேப்பிலை ஒரு கொத்து\r<br>\r<br>அரைக்க:\r<br>\r<br>தேங்காய் துருவல் அரை கப்\r<br>முந்திரி 8\r<br>\r<br><b>செய்முறை:</b>\r<br>\r<br>சின்ன கத்திரிக்காயை குறுக்குவாட்டில்  நறுக்கிக்கொள்ளவும். சின்ன வெங்காயம்,பூண்டு இரண்டையும் உரித்துக்கொள்ளவும்.\r<br>தக்காளியை எண்ணைய் விட்டு நன்றாக வதக்கிக்கொள்ளவும்.புளியை இரண்டுகப் தண்ணீரில் கரைத்துக்கொள்ளவும். தேங்காய் துருவல்,முந்திரி இரண்டையும் நைசாக அரைத்துக்கொள்ளவும்.\r<br>\r<br>வாணலியில் நல்லெண்ணைய் விட்டு காய்ந்ததும் தாளிக்கவேண்டியவைகளை தாளிக்கவும்.\r<br>பின்னர் கத்திரிக்காய்,சின்ன வெங்காயம்,பூண்டு மூன்றையும் போட்டு நன்றாக வதக்கவும்.\r<br>செய்துவைத்த தக்காளி விழுதை போட்டு அதனுடன் ஒரு கப் தண்ணீர் ,உப்பு சேர்த்து நன்றாக கொதிக்கவைக்கவும்.\r<br>புளியை நன்றாக கரைத்து விடவும். பின்னர் மஞ்சள்தூள்,தனியா தூள்,மிளகாய் தூள் சேர்த்து கொதிக்கவிடவும்.\r<br>எண்ணைய் பிரிந்து வந்ததும் அரைத்த விழுதை சேர்த்து ஒரு கொதி வந்ததும் இறக்கவும்\r<br>")
];
